# ETL Project - MLS

In [1]:
# Import Dependencies
import pandas as pd
import numpy as np
from pandas.api.types import CategoricalDtype

from sqlalchemy import create_engine
from config import PH_User_Name
from config import PH_Password

### Extract Data

In [2]:
# Read CSV files in pandas
mmls_path = ('mens_major_league_soccer.csv')
mls_salaries_path = ('mls-salaries-2017.csv')
mmls_data_df = pd.read_csv(mmls_path, header=5, encoding="ISO-8859-1")
mls_salaries = pd.read_csv(mls_salaries_path, encoding="ISO-8859-1")

### Transform Data

Clean Data

In [3]:
# Rename column Names
mmls_data_df.columns = ['rank', 'player', 'nation', 'position', 'squad', 'age', 'born', 'matches_played', 'starts',
                           'min_played', 'goals', 'assist', 'penalty_kicks', 'pk_attempts', 'yell_card', 'red_card',
                           'goals_90', 'assist_90', 'goals_assist_90', 'goals_pk_90', 'goals_assist_pk_90', 'Matches']

mmls_data_df.head(3)

,rank,player,nation,position,squad,age,born,matches_played,starts,min_played,...,penalty_kicks,pk_attempts,yell_card,red_card,goals_90,assist_90,goals_assist_90,goals_pk_90,goals_assist_pk_90,Matches
0,1,Saad Abdul-Salaam\Saad-Abdul-Salaam,us USA,DF,Sporting KC,25,1991,12,10,902,...,0,0,1,0,0.10,0.1,0.20,0.10,0.20,Matches
1,2,Mohammed Abu\Mohammed-Abu,gh GHA,MF,Columbus,25,1991,20,14,1279,...,0,0,3,0,0.00,0.0,0.00,0.00,0.00,Matches
2,3,Lalas Abubakar\Lalas-Abubakar,gh GHA,DF,Columbus,22,1994,7,6,529,...,0,0,2,1,0.17,0.0,0.17,0.17,0.17,Matches

In [4]:
# Remove special characters from Player, separate Player Names and drop extra columns
mmls_data_df[['Name1','Name2']] = pd.DataFrame(mmls_data_df.player.str.split(r'\\',1).tolist())
mmls_data_df.drop(['player', 'Name1', 'Matches'], axis=1, inplace = True)
mmls_data_df = mmls_data_df.rename(columns = {'Name2':'player'})
mmls_data_df['player'] = mmls_data_df['player'].str.replace('-',' ')
mmls_data_df.head(3)

,rank,nation,position,squad,age,born,matches_played,starts,min_played,goals,...,penalty_kicks,pk_attempts,yell_card,red_card,goals_90,assist_90,goals_assist_90,goals_pk_90,goals_assist_pk_90,player
0,1,us USA,DF,Sporting KC,25,1991,12,10,902,1,...,0,0,1,0,0.10,0.1,0.20,0.10,0.20,Saad Abdul Salaam
1,2,gh GHA,MF,Columbus,25,1991,20,14,1279,0,...,0,0,3,0,0.00,0.0,0.00,0.00,0.00,Mohammed Abu
2,3,gh GHA,DF,Columbus,22,1994,7,6,529,1,...,0,0,2,1,0.17,0.0,0.17,0.17,0.17,Lalas Abubakar

In [5]:
# Seporate player into first and last names
mmls_data_df[['first_name','last_name']] = pd.DataFrame(mmls_data_df.player.str.split(r' ',1).tolist())
mmls_data_df.head(3)

,rank,nation,position,squad,age,born,matches_played,starts,min_played,goals,...,yell_card,red_card,goals_90,assist_90,goals_assist_90,goals_pk_90,goals_assist_pk_90,player,first_name,last_name
0,1,us USA,DF,Sporting KC,25,1991,12,10,902,1,...,1,0,0.10,0.1,0.20,0.10,0.20,Saad Abdul Salaam,Saad,Abdul Salaam
1,2,gh GHA,MF,Columbus,25,1991,20,14,1279,0,...,3,0,0.00,0.0,0.00,0.00,0.00,Mohammed Abu,Mohammed,Abu
2,3,gh GHA,DF,Columbus,22,1994,7,6,529,1,...,2,1,0.17,0.0,0.17,0.17,0.17,Lalas Abubakar,Lalas,Abubakar

In [6]:
# Seporate Nation into 2 and 3 digit codes
mmls_data_df[['nat_2digit', 'nat_3digit']] = pd.DataFrame(mmls_data_df.nation.str.split(' ',1).tolist())
mmls_data_df.head(3)

,rank,nation,position,squad,age,born,matches_played,starts,min_played,goals,...,goals_90,assist_90,goals_assist_90,goals_pk_90,goals_assist_pk_90,player,first_name,last_name,nat_2digit,nat_3digit
0,1,us USA,DF,Sporting KC,25,1991,12,10,902,1,...,0.10,0.1,0.20,0.10,0.20,Saad Abdul Salaam,Saad,Abdul Salaam,us,USA
1,2,gh GHA,MF,Columbus,25,1991,20,14,1279,0,...,0.00,0.0,0.00,0.00,0.00,Mohammed Abu,Mohammed,Abu,gh,GHA
2,3,gh GHA,DF,Columbus,22,1994,7,6,529,1,...,0.17,0.0,0.17,0.17,0.17,Lalas Abubakar,Lalas,Abubakar,gh,GHA

In [7]:
# Assigned Column types
mmls_data_df = mmls_data_df.astype({'rank':'int', 'nation':'str', 'position':'str', 'squad':'str', 'age':'int',
                                    'born':'int', 'matches_played':'int', 'starts':'int', 'min_played':'int',
                                    'goals':'int', 'assist':'int', 'penalty_kicks':'int', 'pk_attempts':'int',
                                    'yell_card':'int', 'red_card':'int', 'goals_90':'float', 'assist_90':'float',
                                    'goals_assist_90':'float', 'goals_pk_90':'float', 'goals_assist_pk_90':'float',
                                    'player':'str', 'first_name': 'str', 'last_name': 'str', 'nat_2digit': 'str',
                                    'nat_3digit': 'str'})

mmls_data_df.head(3)

,rank,nation,position,squad,age,born,matches_played,starts,min_played,goals,...,goals_90,assist_90,goals_assist_90,goals_pk_90,goals_assist_pk_90,player,first_name,last_name,nat_2digit,nat_3digit
0,1,us USA,DF,Sporting KC,25,1991,12,10,902,1,...,0.10,0.1,0.20,0.10,0.20,Saad Abdul Salaam,Saad,Abdul Salaam,us,USA
1,2,gh GHA,MF,Columbus,25,1991,20,14,1279,0,...,0.00,0.0,0.00,0.00,0.00,Mohammed Abu,Mohammed,Abu,gh,GHA
2,3,gh GHA,DF,Columbus,22,1994,7,6,529,1,...,0.17,0.0,0.17,0.17,0.17,Lalas Abubakar,Lalas,Abubakar,gh,GHA

In [8]:
# Rename and dropped extra columns
mls_salaries.rename(columns = {'Unnamed: 6':'player'}, inplace = True)
mls_salaries_df = mls_salaries.drop(['last_name','first_name', 'position'], axis=1)
mls_salaries_df.head(3)

  club  base_salary  guaranteed_compensation          player
0  ATL    1912500.0                2297000.0  Miguel Almiron
1  ATL      65625.0                  65625.0   Mikey Ambrose
2  ATL     150000.0                 150000.0      Yamil Asad

Create Tables

In [12]:
# Assign Table ID Series to Variables
salary_id = 2000
squad_id = 5000
position_id = 6000

In [27]:
# Create Player Table
mmls_player = pd.merge(mmls_data_df, mls_salaries, on = ['player', 'first_name', 'last_name'], how = 'outer')
mmls_player = mmls_player[['player','first_name','last_name','born','age','nat_3digit']].drop_duplicates(subset=['player'])
mmls_player = mmls_player.reindex(columns= ['player', 'first_name','last_name','born','age','nat_3digit'])
mmls_player = mmls_player.fillna(0)
mmls_player = mmls_player.astype({'born':'int','age':'int'})
mmls_player.head(3)

              player first_name     last_name  born  age nat_3digit
0  Saad Abdul Salaam       Saad  Abdul Salaam  1991   25        USA
1       Mohammed Abu   Mohammed           Abu  1991   25        GHA
2     Lalas Abubakar      Lalas      Abubakar  1994   22        GHA

In [28]:
# Create Squad table
mmls_squad =  mmls_data_df['squad'].drop_duplicates(keep='first').to_frame()
mmls_squad['squad_id'] = mmls_squad.index + squad_id
mmls_squad.astype({'squad_id':'int'})
mmls_squad = mmls_squad.reindex(columns=['squad_id','squad'])
mmls_squad.head(3)

   squad_id        squad
0      5000  Sporting KC
1      5001     Columbus
3      5003      Chicago

In [29]:
# Create Position Tables
mmls_positions = mmls_data_df['position'].drop_duplicates(keep='first').to_frame()
mmls_positions['position_id'] = mmls_positions.index + position_id
mmls_positions.astype({'position_id':'int'})
mmls_positions = mmls_positions.reindex(columns=['position_id','position'])
mmls_positions.head(3)

   position_id position
0         6000       DF
1         6001       MF
3         6003     MFFW

In [36]:
# Create Salaries Table
mmls_salary = mls_salaries_df[['player', 'base_salary', 'guaranteed_compensation']].drop_duplicates(keep='first')
mmls_salary = mmls_salary.reindex(columns=['player', 'base_salary', 'guaranteed_compensation'])
mmls_salary.head(3)

           player  base_salary  guaranteed_compensation
0  Miguel Almiron    1912500.0                2297000.0
1   Mikey Ambrose      65625.0                  65625.0
2      Yamil Asad     150000.0                 150000.0

In [37]:
# Create Stats Table
mmls_stats = mmls_data_df[['player', 'squad', 'position', 'rank', 'matches_played', 'starts', 'min_played', 'goals',
                           'assist', 'penalty_kicks', 'pk_attempts', 'yell_card', 'red_card', 'goals_90', 'assist_90',
                           'goals_assist_90', 'goals_pk_90', 'goals_assist_pk_90']].drop_duplicates(keep='first')

mmls_stats = mmls_stats.reindex(columns=['player', 'squad', 'position', 'rank', 'matches_played', 'starts',
                                         'min_played', 'goals', 'assist', 'penalty_kicks', 'pk_attempts', 'yell_card',
                                         'red_card', 'goals_90', 'assist_90', 'goals_assist_90', 'goals_pk_90',
                                         'goals_assist_pk_90'])

In [38]:
# Replace Squad Name with Squad ID from Squad Table
for index, sq in mmls_squad.iterrows():
    try:
        mmls_stats.loc[(mmls_stats.squad == sq[1]), 'squad'] = sq[0]
    except:
        mmls_stats.loc[(mmls_stats.squad == sq[1]), 'squad'] = 'nan'

In [39]:
# Replace Position Name with ID from Position Table
for index, post in mmls_positions.iterrows():
    try:
        mmls_stats.loc[(mmls_stats.position == post[1]), 'position'] = post[0]
    except:
        mmls_stats.loc[(mmls_stats.position == post[1]), 'position'] = 'nan'

In [40]:
# Rename Player, Squad and Position Names to ID
mmls_stats.rename(columns = {'squad':'squad_id', 'position':'position_id'}, inplace = True)
mmls_stats.head(3)

,player,squad_id,position_id,rank,matches_played,starts,min_played,goals,assist,penalty_kicks,pk_attempts,yell_card,red_card,goals_90,assist_90,goals_assist_90,goals_pk_90,goals_assist_pk_90
0,Saad Abdul Salaam,5000,6000,1,12,10,902,1,1,0,0,1,0,0.10,0.1,0.20,0.10,0.20
1,Mohammed Abu,5001,6001,2,20,14,1279,0,0,0,0,3,0,0.00,0.0,0.00,0.00,0.00
2,Lalas Abubakar,5001,6000,3,7,6,529,1,0,0,0,2,1,0.17,0.0,0.17,0.17,0.17

## Load Data

In [41]:
# rds_connection_string = "<insert user name>:<insert password>@localhost:5432/customer_db"
# engine = create_engine(f'postgresql://{rds_connection_string}')
engine = create_engine(f'postgresql://{PH_User_Name}:{PH_Password}@localhost:5432/ETL_Team007_Project')

In [215]:
mmls_player.to_sql(name='mmls_player', con=engine, if_exists='append', index=False)

In [216]:
mmls_squad.to_sql(name='mmls_squad', con=engine, if_exists='append', index=False)

In [217]:
mmls_positions.to_sql(name='mmls_positions', con=engine, if_exists='append', index=False)

In [218]:
mmls_salary.to_sql(name='mmls_salary', con=engine, if_exists='append', index=False)

In [219]:
mmls_stats.to_sql(name='mmls_stats', con=engine, if_exists='append', index=False)